%原图
I=imread('./Origin_Image/branch.jpg');
I=rgb2gray(I);
imshow(I);

%预处理
double(I);

%拉普拉斯模板
w1=[0,-1,0;-1,4,-1;0,-1,0];
w2=[-1,-1,-1;-1,8,-1;-1,-1,-1];
w3=[1,4,1;4,-20,4;1,4,1];

L1=imfilter(I,w1,'corr','symmetric');
L2=imfilter(I,w2,'corr','symmetric');
L3=imfilter(I,w3,'corr','symmetric');


imshow(L1);
imshow(L2);
imshow(L3);

%总结
%1.拉普拉斯对噪声(独立点)检测很敏感
%2.拉普拉斯在灰度斜坡或者台阶过渡处会产生双边缘响应（二阶导数算子都有）
%3.二阶导数的符号可用于确定边缘的过渡是从亮到暗还是从暗到亮

%为了弥补拉普拉斯的缺陷，在运用拉普拉斯算子之前先进行高斯低通滤波
%d^2(G(x,y)*f(x,y))
%d表示进行二阶微分，也就是和拉普拉斯算子做卷积
%G(x,y）表示高斯函数  f(x,y)表示原始图像
%由于在线性系统中，卷积和微分的次序可以交换 
%即d^2(G(x,y))*f(x,y)
%效果等价于在运用拉普拉斯算子之前首先进行高斯低通滤波
%低通就是模糊  高通就是得到细节
%d^2(G（x,y）)称为高斯拉普拉斯算子 简称LOG算子  也称为Marr边缘检测算子

%应用Log算子的时候，高斯函数的标准差sigma的选取很关键
%Log克服了拉普拉斯抗噪声差的特点，但是在抑制噪声的同时可能也将原始图像中比较尖锐的边缘平滑掉了


%key1.sigma->Log算子->G''(x,y)->也就是对原图像高斯平滑后求离散的二阶导数
LogH=[0,0,-1,0,0;0,-1,-2,-1,0;-1,-2,16,-2,-1;0,-1,-2,-1,0;0,0,-1,0,0];
LogGet=imfilter(I,LogH,'corr','symmetric');
imshow(LogGet);




















